; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph1 - mode
	infrared2 - mode
	infrared3 - mode
	image0 - mode
	Star0 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Star10 - direction
	GroundStation1 - direction
	GroundStation9 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
)
(:goal (and
	(have_image Phenomenon11 thermograph1)
	(have_image Star12 infrared3)
	(have_image Phenomenon13 infrared2)
	(have_image Planet14 infrared2)
	(have_image Star15 infrared3)
	(have_image Planet16 infrared3)
	(have_image Planet17 infrared3)
))

)

; plan
1. (turn_to satellite0 groundstation1 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet16 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet16)
   goals met: 0 of 7
5. (take_image satellite0 planet16 instrument0 infrared3)
   added: (have_image planet16 infrared3)
   goals met: 1 of 7
6. (turn_to satellite0 planet14 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet14)
   goals met: 1 of 7
7. (take_image satellite0 planet14 instrument0 infrared2)
   added: (have_image planet14 infrared2)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon13 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon13 instrument0 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 3 of 7
10. (turn_to satellite0 phenomenon11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 7
11. (take_image satellite0 phenomenon11 instrument0 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 4 of 7
12. (turn_to satellite0 planet17 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet17)
   goals met: 4 of 7
13. (take_image satellite0 planet17 instrument0 infrared3)
   added: (have_image planet17 infrared3)
   goals met: 5 of 7
14. (turn_to satellite0 star12 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star12)
   goals met: 5 of 7
15. (take_image satellite0 star12 instrument0 infrared3)
   added: (have_image star12 infrared3)
   goals met: 6 of 7
16. (turn_to satellite0 star15 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star15)
   goals met: 6 of 7
17. (take_image satellite0 star15 instrument0 infrared3)
   added: (have_image star15 infrared3)
   goals met: 7 of 7
